src/ИТМО/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номеклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/ИТМО/src/Documents/ДокументУстановкиЦен/ДокументУстановкиЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументУстановкиЦен</name>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/ИТМО/src/Documents/ПоступлениеТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Объект = Ссылка.ПолучитьОбъект();
		цДок = Документы.ДокументУстановкиЦен.СоздатьДокумент();
		цДок.Артикул= ЭтотОбъект.Артикул;
		Запрос=Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 2
	           |	СРЕДНЕЕ(ПоступлениеТоваров.Цена) КАК Цена
	           |ИЗ
	           |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	           |
	           |СГРУППИРОВАТЬ ПО
	           |	ПоступлениеТоваров.Дата";
		Результат=Запрос.Выполнить().Выгрузить();
		цДок.Наименование = ЭтотОбъект.Наименование;
		цДок.Цена=ЭтотОбъект.Цена;
		цДок.Дата= ЭтотОбъект.Дата;
		цДок.УстановитьНовыйНомер();
		цДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецПроцедуры
